{
  "step01": "<p>Vamos começar definindo o espaço onde vamos twittar. E vamos aproveitar e criar também um cabeçalho para mostrar onde vamos twittar. Para isso vamos utilizar <a href='https://pt.wikipedia.org/wiki/HTML'><b> HTML</a> </b>que é uma das linguagens que podemos utilizar pra criar websites.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>A linha 1 cria um DIV, este é um elemento do HTML que cria um espaço em branco onde podemos inserir qualquer conteúdo<br />Dentro do <b>div</b> inserimos uma imagem com o elemento <b>img</b> que tem duas propriedades <b>src e alt</b>, onde <b>src</b> é o nome do arquivo que vamos mostrar e o <b>alt</b>é uma breve descrição da imagem</p>",
  "step02": "<p>Acho que está faltando estilo para esse cabeçalho!!! Que tal deixarmos ele mais bonito utilizando CSS. CSS é uma linguagem que pode criar estilos para cada elemento da nossa aplicação.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>Primeiro precisamos dizer qual elemento do HTML vamos estilizar para isso chamamos o elemento <b>div</b>. Depois vamos colocar cada estilo. A propriedade <b>width</b> é a largura do elemento. Depois, colocamos uma borda cinza, que em inglês é border e a cor é grey <b>width</b>. Nossa borda tem outras propriedades como 1px e solid, ne? 1px(pixel) é a finura dela e solid quer dizer sólida. Ou seja, ela é uma linha retinha, não é pontilhada e ou outro estilo. E por último o padding, que significa um preenchimento de espaço em todos os cantinhos do nosso cabeçalho. Então, a gente coloca uns 30px(pixels), que é a medida que fica legal. 😍 <b></b> E se quiser saber mais dos elementos do <b>HTML</b> e propriedades do CSS,você pode acessar um site bem legal clicando <a href='https://www.w3schools.com/default.asp'><b> AQUI</a></p>",
  "step03": "<p>Agora é hora de criarmos a área onde vamos digitar nossos tweets. Para isso vamos usar um elemento do HTML chamado TextArea com a propriedade <b e alt>placeholder</b, onde <b>src</b> é utilizada para deixar uma dica para o usuário saber o que digitar naquele campo.</p>",
  "step04": "Agora vamos colocar tudo no seu devido lugar! Para isso vamos voltar a usar o <b>CSS</b>. Agora você já sabe que cada elemento do <b>HTML</b> pode ter seus próprios estilo.<br/>O componente <b>div</b>está novamente aumenta sua largura para ocupar toda a tela e agora utiliza o <b>display: flex</b>isso irá fazer com que todo o conteúdo dentro do <b>div</b> tenha flexibilidade para que possamos alinhar os demais componentes.<br/>No componente <b>img</b> vamos definar a largura da foto do perfil para 45px, isso já fará com que a altura fique na mesma proporção.<br/>Agora para deixarmos a foto de perfil redonda vamos usar a propriedade <b>border-radius</b>  <b></b>",
  "step05": "<p>Lembra do CSS? Vamos usar ele novamente para deixar a lista dos tweets mais bonita.</p>",
  "step06": "<p>??</p>",
  "step07": "<p>Olha que legal, você acabou de construir seu próprio tweeter. Você passou por vários passos, tudo que você construiu usando HTML e CSS chamamos de camada de aplicação e o que foi criado com o JavaScript chamamos de camada de controle. Agora você sabe que uma aplicação pode ser construída utilizando diferentes linguagens de programação e é dividida em diferentes camadas</p>"
}
