{
  "step01": "<p>Vamos começar definindo o espaço onde vamos twittar. E vamos aproveitar e criar também um cabeçalho para mostrar onde vamos twittar. Para isso vamos utilizar <a href='https://pt.wikipedia.org/wiki/HTML'><b> HTML</a> </b>que é uma das linguagens que podemos utilizar pra criar websites.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>A linha 1 cria um DIV, este é um elemento do HTML que cria um espaço em branco onde podemos inserir qualquer conteúdo<br />Dentro do <b>div</b> inserimos uma imagem com o elemento <b>img</b> que tem duas propriedades <b>src e alt</b>, onde <b>src</b> é o nome do arquivo que vamos mostrar e o <b>alt</b>é uma breve descrição da imagem</p>",
  "step02": "<p>Acho que está faltando estilo para esse cabeçalho!!! Que tal deixarmos ele mais bonito utilizando CSS. CSS é uma linguagem que pode criar estilos para cada componente da nossa aplicação.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>Primeiro precisamos dizer qual elemento do HTML vamos estilizar para isso chamamos o elemento <b>div</b>. Depois vamos colocar cada estilo a propriedade <b>width</b> é a largura do elemento,a <b></b></p>",
  "step03": "Agora é hora de criarmos a área onde vamos digitar nossos tweets. Para isso vamos usar um elemento do HTML chamado TextArea com a propriedade <b e alt>placeholder</b, onde <b>src</b> é utilizada para deixar uma dica para o usuário saber o que digitar naquele campo.",
  "step04": "Que tal agora criarmos o botão que envia o tweet? Vamos entrar agora em uma Linguagem de Programação chamada Javascript. O Javascript nos deixa criar mecanismos dinâmicos em nossas páginas, assim podemos interagir com os componentes HTML que criamos anterioirmente. Agora vamos fazer nosso tweet ficar armazenado na nuvem!",
  "step05": "Lembra do CSS? Vamos usar ele novamente para deixar a lista dos tweets mais bonita. ",
  "step06": "Olha que legal, você acabou de construir seu próprio tweeter. Você passou por vários passos, tudo que você construiu usando HTML e CSS chamamos de camada de aplicação e o que foi criado com o JavaScript chamamos de camada de controle. Agora você sabe que uma aplicação pode ser construída utilizando diferentes linguagens de programação e é dividida em diferentes camadas"
}
