{
  "step01": "Vamos começar definindo o espaço onde vamos twittar. E vamos aproveitar e criar também um cabeçalho para mostrar onde vamos twittar. Para isso vamos utilizar <a href='https://pt.wikipedia.org/wiki/HTML'><b> HTML</a> </b>que é uma das linguagens que podemos utilizar pra criar websites.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>A linha 1 cria um DIV, este é um elemento do HTML que cria um espaço em branco onde podemos inserir qualquer conteúdo<br />Dentro do <b>div</b> inserimos uma imagem com o elemento <b>img</b> que tem duas propriedades <b>src e alt</b>, onde <b>src</b> é o nome do arquivo que vamos mostrar e o <b>alt</b> é uma breve descrição da imagem",
  "step02": "Acho que está faltando estilo para esse cabeçalho!!! Que tal deixarmos ele mais bonito utilizando CSS. CSS é uma linguagem que pode criar estilos para cada elemento da nossa aplicação.<br /><b style='color:#440071; font-size:16px'>> codeXplica:</b><br/>Primeiro precisamos dizer qual elemento do HTML vamos estilizar para isso chamamos o elemento <b>div</b>. Depois vamos colocar cada estilo. A propriedade <b>width</b> é a largura do elemento. <br><br>Depois, colocamos uma borda cinza, que em inglês é border e a cor é grey <b>width</b>. Nossa borda tem outras propriedades como 1px e solid, ne? 1px(pixel) é a finura dela e solid quer dizer sólida. Ou seja, ela é uma linha retinha, não é pontilhada e ou outro estilo. E por último o padding, que significa um preenchimento de espaço em todos os cantinhos do nosso cabeçalho. Então, a gente coloca uns 30px(pixels), que é a medida que fica legal. 😍 <b></b> E se quiser saber mais dos elementos do <b>HTML</b> e propriedades do CSS,você pode acessar um site bem legal clicando <a href='https://www.w3schools.com/default.asp'><b> AQUI</a>",
  "step03": "Agora é hora de criarmos a área onde vamos digitar nossos tweets e onde tem o nosso perfil. Para isso vamos usar mais alguns elementos do HTML. Vamos apresentar esses novos elementos:  <b>text area e button </b>. Text area é nossa caixinha de texto, onde vamos digitar nosso twitte. E button é nosso botão, para enviar nosso twitte. 🤓 Para saber mais desses elementos, clique <a href='https://www.w3schools.com/default.asp'><b> AQUI</a>",
  "step04": "Que tal agora criarmos o botão que envia o tweet? Vamos entrar agora em uma Linguagem de Programação chamada Javascript. O Javascript nos deixa criar mecanismos dinâmicos em nossas páginas, assim podemos interagir com os componentes HTML que criamos anterioirmente. Agora vamos fazer nosso tweet ficar armazenado na nuvem!",
  "step05": "Voltando para o HTML para criarmos o nosso nome no twitte e o texto. O elemento agora a ser apresentado é o <b>p</b>. Ele representa o parágrafo, nós também chamamos ele de elemento block, ou seja, ele automáticamente vai para a linha de baixo, sempre que ele for colocado. E o elemento <b>b</>, que significa bold, que é negrito. Ih, já esqueceu o que era o elemento <b> div</b>? Relaxa, é uma divisão, uma caixa onde você pode colocar outros elementos. E mais pra frente você entenderá como ela nos ajuda a posicionar tudo na tela! Anotado? ✌",
  "step06": "Opa, estamos quase acabando o nosso Twitter! Agora o estilo ou seja, nosso CSS. As propriedades são cada vez mais complicadinhas. Vamos explicar as novas propriedades e como chegamos até aqui. Parece que não tem muito estilo, ne? <br>Mas por trás desses dois simples parágrafos, tem sim! O <b>display: flex</b> deixa a posição dos textos flexíveis para posicionarmos onde queremos. Com isso a outra propriedade <b> flex-column</b> fica disponível e nós queremos que fique um embaixo do outro, então usamos o <b>column</b>. Agora pratimente terminamos! O resultado está próximo! 👏👏👏",
  "step07": "Olha que legal, você acabou de construir seu próprio tweeter. Você passou por vários passos, tudo que você construiu usando HTML e CSS chamamos de camada de aplicação e o que foi criado com o JavaScript chamamos de camada de controle. Agora você sabe que uma aplicação pode ser construída utilizando diferentes linguagens de programação e é dividida em diferentes camadas"
}
